{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [1, 50, 1], "consume_less": "cpu", "output_dim": 256, "inner_init": "orthogonal", "name": "lstm_1", "U_regularizer": null, "return_sequences": false, "go_backwards": false, "input_dtype": "float32", "init": "glorot_uniform", "W_regularizer": null, "inner_activation": "hard_sigmoid", "activation": "tanh", "trainable": true, "unroll": false, "dropout_W": 0.0, "stateful": true, "dropout_U": 0.0, "b_regularizer": null, "forget_bias_init": "one"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "output_dim": 1, "name": "dense_1", "activation": "linear", "init": "glorot_uniform", "input_dim": 256, "trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}