{"config": [{"config": {"return_sequences": false, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "inner_init": "orthogonal", "batch_input_shape": [1, 50, 1], "dropout_U": 0.0, "input_dtype": "float32", "output_dim": 256, "forget_bias_init": "one", "W_regularizer": null, "activation": "tanh", "inner_activation": "hard_sigmoid", "name": "lstm_1", "stateful": true, "consume_less": "cpu", "unroll": false, "U_regularizer": null, "dropout_W": 0.0, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "output_dim": 1, "bias": true, "W_regularizer": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "input_dim": 256}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.0"}