{"config": [{"config": {"stateful": true, "forget_bias_init": "one", "batch_input_shape": [1, 50, 1], "dropout_W": 0.0, "consume_less": "cpu", "unroll": false, "input_dtype": "float32", "return_sequences": false, "activation": "tanh", "name": "lstm_1", "U_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "dropout_U": 0.0, "output_dim": 256, "W_regularizer": null, "go_backwards": false, "trainable": true}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "b_regularizer": null, "output_dim": 1, "input_dim": 256, "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}